#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
module.vpc.data.aws_availability_zones.az_list: Reading...
module.vpc.aws_vpc.vpc: Refreshing state... [id=vpc-0eea91439b4c0bda8]
module.eks.aws_iam_role.eks_node_role: Refreshing state... [id=eks-node-group-role]
module.vpc.aws_eip.lb: Refreshing state... [id=eipalloc-0efbf66ad6b6646c5]
module.eks.aws_iam_role.eks_role: Refreshing state... [id=eks-cluster-role]
module.eks.aws_iam_role_policy_attachment.eks_np_Policy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSNetworkingPolicy]
module.eks.aws_iam_role_policy_attachment.eks_ebs_Policy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSBlockStoragePolicy]
module.eks.aws_iam_role_policy_attachment.eks_policy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSClusterPolicy]
module.eks.aws_iam_role_policy_attachment.eks_elb_Policy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSLoadBalancingPolicy]
module.eks.aws_iam_role_policy_attachment.node_ecr_ReadOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryReadOnly]
module.eks.aws_iam_role_policy_attachment.eks_ComputePolicy: Refreshing state... [id=eks-cluster-role/arn:aws:iam::aws:policy/AmazonEKSComputePolicy]
module.eks.aws_iam_role_policy_attachment.node_cni: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKS_CNI_Policy]
module.vpc.data.aws_availability_zones.az_list: Read complete after 0s [id=eu-west-1]
module.eks.aws_iam_role_policy_attachment.node_ecr_PullOnly: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEC2ContainerRegistryPullOnly]
module.eks.aws_iam_role_policy_attachment.node_ssm: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonSSMManagedInstanceCore]
module.eks.aws_iam_role_policy_attachment.eks_worker_policy: Refreshing state... [id=eks-node-group-role/arn:aws:iam::aws:policy/AmazonEKSWorkerNodePolicy]
module.vpc.aws_subnet.prv1_subnet: Refreshing state... [id=subnet-0d123ecd278f1f7db]
module.vpc.aws_subnet.prv2_subnet: Refreshing state... [id=subnet-0aab408c7355ee913]
module.vpc.aws_subnet.pub1_subnet: Refreshing state... [id=subnet-0220cbef453c9f19a]
module.vpc.aws_subnet.pub2_subnet: Refreshing state... [id=subnet-081b634013429de84]
module.vpc.aws_subnet.prv3_subnet: Refreshing state... [id=subnet-0be51b21b308e6bec]
module.vpc.aws_internet_gateway.gw: Refreshing state... [id=igw-0fd01b03ed44b5796]
module.vpc.aws_subnet.pub3_subnet: Refreshing state... [id=subnet-0c9d7fd0bb1eeeab7]
module.eks.aws_security_group.eks_node_sg: Refreshing state... [id=sg-0b88bba5f4fb64f92]
module.vpc.aws_nat_gateway.nat: Refreshing state... [id=nat-036b4cb9444ec7320]
module.vpc.aws_route_table.pub_routes: Refreshing state... [id=rtb-00d7cef2315172c3c]
module.vpc.aws_route_table.nat_routes: Refreshing state... [id=rtb-0c5130485b424b0df]
module.eks.aws_eks_cluster.eks: Refreshing state... [id=eks-sharks-cluster]
module.vpc.aws_route_table.prv_routes: Refreshing state... [id=rtb-0e7b8cf7f3c34a450]
module.vpc.aws_route_table_association.pub1_subnet_route: Refreshing state... [id=rtbassoc-0b325e98773c4dc27]
module.vpc.aws_route_table_association.pub2_subnet_route: Refreshing state... [id=rtbassoc-0513b183e622b4b31]
module.vpc.aws_route_table_association.pub3_subnet_route: Refreshing state... [id=rtbassoc-0670bb9748c83ef1b]
module.vpc.aws_route_table_association.prv1_subnet_route: Refreshing state... [id=rtbassoc-0afbb79ae17bb0e03]
module.vpc.aws_route_table_association.prv3_subnet_route: Refreshing state... [id=rtbassoc-03d16bcf099d58b56]
module.vpc.aws_route_table_association.prv2_subnet_route: Refreshing state... [id=rtbassoc-08307e3f7d72d4103]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_cluster.eks will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_cluster" "eks" {
      + access_config             = (known after apply)
      + arn                       = (known after apply)
      + certificate_authority     = (known after apply)
      + cluster_id                = (known after apply)
      + compute_config            = (known after apply)
      + created_at                = (known after apply)
      + enabled_cluster_log_types = (known after apply)
      + endpoint                  = (known after apply)
      + id                        = (known after apply)
      + identity                  = (known after apply)
      + kubernetes_network_config = (known after apply)
      + name                      = "eks-sharks-cluster"
      + outpost_config            = (known after apply)
      + platform_version          = (known after apply)
      + region                    = (known after apply)
      + remote_network_config     = (known after apply)
      + role_arn                  = (known after apply)
      + status                    = (known after apply)
      + storage_config            = (known after apply)
      + tags                      = (known after apply)
      + upgrade_policy            = (known after apply)
      + version                   = (known after apply)
      + vpc_config                = (known after apply)
      + zonal_shift_config        = (known after apply)
    }

  # module.eks.data.aws_security_group.eks_cluster_sg will be read during apply
  # (config refers to values not yet known)
 <= data "aws_security_group" "eks_cluster_sg" {
      + arn         = (known after apply)
      + description = (known after apply)
      + id          = (known after apply)
      + name        = (known after apply)
      + region      = (known after apply)
      + tags        = (known after apply)
      + vpc_id      = (known after apply)
    }

  # module.eks.aws_eks_cluster.eks will be updated in-place
  ~ resource "aws_eks_cluster" "eks" {
        id                            = "eks-sharks-cluster"
        name                          = "eks-sharks-cluster"
        tags                          = {
            "environment" = "prod"
        }
      ~ version                       = "1.33" -> "1.32"
        # (12 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.eks.aws_eks_node_group.eks_nodes will be created
  + resource "aws_eks_node_group" "eks_nodes" {
      + ami_type               = "AL2_x86_64"
      + arn                    = (known after apply)
      + capacity_type          = (known after apply)
      + cluster_name           = "eks-sharks-cluster"
      + disk_size              = (known after apply)
      + id                     = (known after apply)
      + instance_types         = (known after apply)
      + node_group_name        = "eks_nodes_group"
      + node_group_name_prefix = (known after apply)
      + node_role_arn          = "arn:aws:iam::975049996360:role/eks-node-group-role"
      + region                 = "eu-west-1"
      + release_version        = (known after apply)
      + resources              = (known after apply)
      + status                 = (known after apply)
      + subnet_ids             = [
          + "subnet-0aab408c7355ee913",
          + "subnet-0d123ecd278f1f7db",
        ]
      + tags                   = {
          + "Name"        = "eks_nodes_group"
          + "environment" = "prod"
        }
      + tags_all               = {
          + "Name"        = "eks_nodes_group"
          + "environment" = "prod"
        }
      + version                = (known after apply)

      + node_repair_config (known after apply)

      + scaling_config {
          + desired_size = 2
          + max_size     = 3
          + min_size     = 2
        }

      + update_config (known after apply)
    }

  # module.eks.aws_security_group_rule.allow_control_plane_to_nodes will be created
  + resource "aws_security_group_rule" "allow_control_plane_to_nodes" {
      + from_port                = 10250
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = "sg-0b88bba5f4fb64f92"
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = (known after apply)
      + to_port                  = 10250
      + type                     = "ingress"
    }

  # module.eks.aws_security_group_rule.allow_nodes_to_control_plane will be created
  + resource "aws_security_group_rule" "allow_nodes_to_control_plane" {
      + from_port                = 443
      + id                       = (known after apply)
      + protocol                 = "tcp"
      + region                   = "eu-west-1"
      + security_group_id        = (known after apply)
      + security_group_rule_id   = (known after apply)
      + self                     = false
      + source_security_group_id = "sg-0b88bba5f4fb64f92"
      + to_port                  = 443
      + type                     = "ingress"
    }

Plan: 3 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @Adebisea, Action: `pull_request`, Working Directory: ``, Workflow: `Infra Setup CI/CD Pipeline`*